In [1]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     ---------------------------------------- 43.8/43.8 kB ? eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [2]:
import pymysql

In [13]:
import pandas as pd

In [3]:
conn = pymysql.connect(host='127.0.0.1', user='root', password='1234', charset='utf8')

In [4]:
cursor = conn.cursor()

In [5]:
sql = 'create database if  not exists flask_db;'

cursor.execute(sql)

1

In [6]:
sql = 'use flask_db;'
cursor.execute(sql)

0

In [10]:
sql = """
create table if not exists member(
id int not null,
userid varchar(50) not null,
pwd varchar(200) not null,
name varchar(20),
email varchar(50),
regdate datetime)
"""

cursor = conn.cursor()
cursor.execute(sql)

0

In [11]:
sql = """
insert into member values 
(1, 'aaa', '1234', '아이유', 'aaa@aaa.co.kr', '2019-06-24'),
(2, 'bbb', '1234', '방탄아미', 'dfs@aaa.co.kr', '2011-05-21');
"""

cursor.execute(sql)

2

In [14]:
sql = 'select * from member;'
pd.read_sql(sql, conn)

C:\Users\human\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id userid   pwd  name          email    regdate
0   1    aaa  1234   아이유  aaa@aaa.co.kr 2019-06-24
1   2    bbb  1234  방탄아미  dfs@aaa.co.kr 2011-05-21

In [15]:
sql = """
create table if not exists point_table (
point_stu_idx int,
point_stu_grade varchar(50),
point_stu_kor varchar(50)
);
"""

cursor.execute(sql)

0

In [16]:
sql = """
insert into point_table values 
(2, '2', '90'),
(2, '3', '95'),
(1, '1', '85');
"""

cursor.execute(sql)

3

In [17]:
sql = 'select * from point_table;'
pd.read_sql(sql, conn)

C:\Users\human\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   point_stu_idx point_stu_grade point_stu_kor
0              2               2            90
1              2               3            95
2              1               1            85

In [19]:
sql = """
create table if not exists student_table(
stu_idx int,
stu_name varchar(50),
stu_age varchar(4),
stu_addr varchar(50));
"""

cursor.execute(sql)

0

In [20]:
sql = """
insert into student_table values 
(1, '홍길동', '18', '서울시'),
(2, '김개호', '25', '서울시');
"""

cursor.execute(sql)

2

In [21]:
sql = 'select * from student_table;'
pd.read_sql(sql, conn)

C:\Users\human\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   stu_idx stu_name stu_age stu_addr
0        1      홍길동      18      서울시
1        2      김개호      25      서울시

In [22]:
sql = 'show tables;'
pd.read_sql(sql, conn)

C:\Users\human\anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

  Tables_in_flask_db
0             member
1        point_table
2      student_table

In [23]:
conn.commit()

In [24]:
conn.close()